Chapters/Basic_philosophical_commitments.tex
\chapter{Basic philosophical commitments}
\label{sec:org696364a}
I want to start this essay by setting out some basic features of my approach to
moral philosophy.
One of the most important features of my approach is a form of pragmatic pluralism
about both ontology and ethics.
 The gist of this position is that the world itself does not fully determine
either a singular true portrayal of the world, or a single correct set of ethical
beliefs.
Human beings create their understandings of the world and their ethical views
through active engagement with the world.
I believe both that their is more than one reasonable way to construe the world
and that some views reflect deep features of the world more effectively than
others, or are more useful than others in a variety of other ways.
Something similar is true of ethics.

I will explain the particular flavor of ontological pluralism that informs my
ethics and metaethics in \refse{sec:ont_plural}.
After this I will explain how I understand moral reasoning, in
\refse{sec:nat_mor}.
\section{Ontological pluralism}
\label{sec:ont_plural}
The funda
\section{On the nature of morality and moral reasoning}
\label{sec:nat_mor}
\section{Ethical and metaethical pluralism}
\label{sec:eth_plural}
There are at least four basic philosophical commitments that inform my approach.

I want to answer the question, what are we doing when we are doing moral
philosophy.
\chapter{Foundational ethical commitments}
\label{ch:eth_com}
